In [3]:
# pandas_study_02_DataFrame

In [4]:
import pandas as pd
import numpy as np

In [6]:
pd.DataFrame([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]], columns = ['가', '나', '다'])

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
# dictionary를 통한 생성도 가능 
# 편리한 점은 dictionary의 key 값이 자동으로 column명으로 지정

data = {
    'name' : ['Kim', 'Lee', 'Park'],
    'age' : [24, 27, 34],
    'children' : [2, 1, 3]
}

df = pd.DataFrame(data)
df

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [11]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
df.columns

Index(['name', 'age', 'children'], dtype='object')

In [13]:
df.values

array([['Kim', 24, 2],
       ['Lee', 27, 1],
       ['Park', 34, 3]], dtype=object)

In [14]:
df.dtypes

name        object
age          int64
children     int64
dtype: object

In [15]:
df.T

            0    1     2
name      Kim  Lee  Park
age        24   27    34
children    2    1     3

In [17]:
df.index = list('abc')
df

   name  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [18]:
df['name']

a     Kim
b     Lee
c    Park
Name: name, dtype: object

In [19]:
type(df['name'])

pandas.core.series.Series

In [20]:
df[['name', 'children']]

   name  children
a   Kim         2
b   Lee         1
c  Park         3

In [21]:
df.rename(columns={'name':'이름'})

     이름  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [22]:
df.rename(columns={'name': '이름'}, inplace=True)
df

     이름  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [23]:
# 생성된 DataFrame은 df 변수에 할당한다

In [24]:
data = {
    'food' : ['KFC', 'McDonald', 'SchoolFood'], 
    'price' : [1000, 2000, 2500],
    'rating' : [4.5, 3.9, 4.2]
}

df = pd.DataFrame(data)
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [25]:
df[['food', 'rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

In [27]:
df.rename(columns={'food':'place'}, inplace=True)
df

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2